app/controllers/ideas_controller.rb

  def show
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @idea = Idea.find(params[:id])
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @idea = Idea.new(idea_params)

    if @idea.save
---
INSERT INTO "ideas" ("created_at", "description", "neam", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 22 Mar 2014 16:43:10 UTC +00:00], ["description", "This is a test"], ["neam", "Test Idea"], ["picture", "test"], ["updated_at", Sat, 22 Mar 2014 16:43:10 UTC +00:00]]

  def update
    @idea = Idea.find(params[:id])
    if @idea.update(idea_params)
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = 6  [["picture", "IMG_2391.JPG"], ["updated_at", Sat, 22 Mar 2014 20:53:10 UTC +00:00]]

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 2]]